Hi @sdwerwed After looking at the issue I found an interesting point. The output says `(known after apply)` for `scope`. Since it is not a `Computed` property, this means the upstream value of it is changed and the value is only known after the apply. I could think of an example: For below configuration
```hcl
provider "azurerm" {
  features {}
}
resource "azurerm_resource_group" "test" {
  name = "yicm-rg"
  location = "eastus"
}
resource "azurerm_user_assigned_identity" "test" {
  name = "yicm-identity"
  location = "eastus"
  resource_group_name = azurerm_resource_group.test.name
}
resource "azurerm_resource_group" "assignment" {
  name = "yicm-rg-assignment"
  location = "eastus"
}
resource "azurerm_resource_group" "assignment_2" {
  name = "yicm-rg-assignment-2"
  location = "eastus"
}
resource "azurerm_role_assignment" "test" {
  scope                = azurerm_resource_group.assignment.id
  principal_id         = azurerm_user_assigned_identity.test.principal_id
  role_definition_name = "Owner"
}
```
If I change `azurerm_resource_group.assignment.location` from `eastus` to `westus` to let its `id` be calculated again, `azurerm_resource_group.assignment.id` can only be known after the apply, the behavior will be same as yours.
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_resource_group.assignment must be replaced
-/+ resource "azurerm_resource_group" "assignment" {
      ~ id       = "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroups/yicm-rg-assignment" -> (known after apply)
      ~ location = "eastus" -> "westus" # forces replacement
        name     = "yicm-rg-assignment"
      - tags     = {} -> null
    }

  # azurerm_role_assignment.test must be replaced
-/+ resource "azurerm_role_assignment" "test" {
      ~ id                               = "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroups/yicm-rg-assignment/providers/Microsoft.Authorization/roleAssignments/4ab771b0-46c2-d7ae-a50f-2416cb45cabb" -> (known after apply)
      ~ name                             = "4ab771b0-46c2-d7ae-a50f-2416cb45cabb" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> (known after apply)
      ~ scope                            = "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroups/yicm-rg-assignment" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
But instead, if I change the `azurerm_role_assignment.test.scope` from `azurerm_resource_group.assignment.id` to `azurerm_resource_group.assignment_2.id`, because the id is already calculated at first apply, the force replacement will print the actual id instead of `known after aply`
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_role_assignment.test must be replaced
-/+ resource "azurerm_role_assignment" "test" {
      ~ id                               = "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroups/yicm-rg-assignment/providers/Microsoft.Authorization/roleAssignments/4ab771b0-46c2-d7ae-a50f-2416cb45cabb" -> (known after apply)
      ~ name                             = "4ab771b0-46c2-d7ae-a50f-2416cb45cabb" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> (known after apply)
      ~ scope                            = "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroups/yicm-rg-assignment" -> "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroups/yicm-rg-assignment-2" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

From the given detail I'm not able to determine if this is the root cause, but if you can share how the `azurerm_role_assignment.test.scope` is calculated in your terraform config file and what has been changed in the second apply, that would be helpful for troubleshooting.